<template>
  <TheCardToolbar toolbar-title="Общение" />
  <v-card max-width="900" variant="text" class="mx-auto">
    <v-card-actions>
      <VCardTitle v-text="'Малые Группы'"/>
      <VSpacer />
      <v-btn variant="outlined">Хочу найти Малую Группу</v-btn>
    </v-card-actions>
    <v-card max-width="900" class="ma-1">
      <ListOfLeaders />
    </v-card>
    <v-card-actions>
      <VCardTitle v-text="'Крещение'"/>
      <VSpacer />
      <v-btn variant="outlined">Хочу креститься</v-btn>
    </v-card-actions>
    <v-card elevation="3" max-width="900" class=" ma-1">
      <v-card-text>Водное крещение — это первое важнейшее таинство в жизни верующего человека. Оно не делает человека христианином, но оно показывает, что он им является. Это внешний символ внутреннего посвящения, которое делает человек в своём сердце, обретая новую жизнь в Иисусе Христе.

        Мы верим, что крещение нужно принимать по вере, в осознанном возрасте, исповедуя Иисуса Христа Господом и Спасителем.</v-card-text>
    </v-card>
    <v-card-actions>
      <VCardTitle v-text="'1+ 1'"/>
      <VSpacer />
      <v-btn variant="outlined">Найти мне наставника</v-btn>
    </v-card-actions>
    <v-card elevation="3" max-width="900" class=" ma-1">
      <v-card-text>Программа «1+1» — это индивидуальное наставничество для людей, недавно принявших Иисуса Христа.

        На первых этапах христианской жизни у новообращенных христиан возникают множество вопросов, страхов, сомнений и искушений. Это абсолютно нормально.

        Программа «1+1» — это 3-х месячная программа, которая предполагает еженедельные встречи с наставником, где с помощью учебного пособия с примерами, иллюстрациями и домашними заданиями, раскрываются основы христианской жизни и подробно рассматриваются насущные вопросы и страхи, возникающие у большинства недавно уверовавших людей.

        Индивидуальный подход к каждому человеку позволяет достичь высоких результатов в том, чтобы человек утвердился в Божьей любви, укоренился в церкви и достигал духовной зрелости.</v-card-text>
    </v-card>
    <v-card-actions>
      <VCardTitle class="text-center" v-text="'Встреча-знакомство'"/>
      <VSpacer />
      <v-btn variant="outlined">Записаться</v-btn>
    </v-card-actions>
    <v-card elevation="3" max-width="900" class="ma-1">
      <v-card-text>Если вы недавно присоединились к нашей церкви (в течение 2 месяцев) или сегодня пришли впервые, приглашаем вас на Встречу-Знакомство.

        Мы с пасторами, лидерами и служителями церкви будем рады познакомиться с вами и провести время в дружеском общении за чашечкой чая, рассказать о себе, о церкви, ответить на вопросы и помолиться за вас.</v-card-text>
    </v-card>
  </v-card>
</template>

<script setup>
import TheCardToolbar from '@/components/navigations/TheCardToolbar.vue'
import ListOfLeaders from '@/components/purposes/purposeFellowship/listOfLeaders.vue'
</script>