<template>
  <StoriesComponent />
  <SundayCard/>
  <WeekEvents/>
  <v-card-title class="mt-6">Новости церкви</v-card-title>
  <NewsCard v-for="(item, i) in appNews" :key="i" :title="item.title" :subtitle="item.subtitle" :img="item.img" :text="item.text"/>
</template>

<script setup>
import SundayCard from '@/components/home/sundayCard.vue'
import WeekEvents from '@/components/calendar/weekEvents.vue'
import NewsCard from '@/components/home/newsCard.vue'
import newsEx from '@/assets/appPics/newsEx.jpg'
import newsEx2 from '@/assets/appPics/newsEx2.jpg'
import {ref} from 'vue'
import StoriesComponent from '@/components/home/storiesComponent.vue'

const appNews = ref([
  {
    title: 'title news 1',
    subtitle: 'Открыть благословление епископа',
    text: `Мир вам, дорогие друзья, братья и сёстры!

Оставляя ученикам последние наставления перед Своим уходом, Христос говорил: «мир Мой оставляю вам! Не так как этот мир, Я даю вам мир!» … «Тот, Кто в вас, больше того, кто в мире!» …  «Из того узнают, что вы Мои ученики, если будете иметь Любовь между собой!»
Или вот ещё: «Да не смущается сердце ваше! Верьте в Бога и в Меня веруйте!»

В феврале будет уже год, как началась СВО, которая, возможно, поссорила друзей, разлучила родных и близких, кого-то на время, а кого-то навсегда или, как минимум, до Второго Пришествия…

Окружающие обстоятельства атакуют наше мышление, пытаясь украсть мир, посеять раздор и наполнить сердца ненавистью!

Сейчас, друзья, как никогда раньше, нам необходимо ухватиться за Слова Иисуса Христа и строить свой дом жизни на Камне Его Обетований, а не на зыбких песках изменяющихся обстоятельств и обещаниях человеческих!

Я выбираю Любить во что бы то ни стало!  Я принимаю решение доверять Его Слову, не смотря на информационное давление окружающего мира! Я буду сражаться за мир в своём сердце и хранить его, не позволяя поднимающимся бурям обстоятельств похитить Божественный покой!

Давайте мы с вами все, как одна семья, скажем на это «АМИНЬ» и будем жить в соответствии с провозглашённым решением!

И да поможет нам в этом Господь!

С любовью, Дмитрий Шатров`,
    img: newsEx,
  }, {
    title: 'title news 2',
    subtitle: 'Прочитать',
    text: `Как часто нам хочется пообсуждать чьи-то решения, сказанные слова и чье-то поведение. Наша плоть так устроена, что готова в первую очередь обсуждать других людей и совсем забыть про наблюдение и исправление самого себя.

Писание не раз запрещает нам говорить плохо о вышестоящих людях, и даже думать о них в негативном свете. Подобные наставления подводят нас к необходимости победить данный порок не для галочки, а на уровне сердца. Оставаясь на стороне осуждающих и распускающих худую молву, мы вредим сами себе, ослабляя свои же собственные позиции.

«Не говори плохо о царе, даже не думай о нем плохо, не говори плохо о богатых, даже если ты в спальне своей один, потому что маленькая птица может перелететь и рассказать им все, что ты сказал» (Библия, Книга Екклесиаст 10:20)

Пастор Даниил`,
    img: newsEx2
  },
])

</script>